<template>
<div>
    <div class="head-show">
        <div class="head-picture">
            <div class="img">
                <img src="../../img/profile.jpg"  alt="头像">
            </div>
            <div>
                <div class="name">王坤<i style="color:#BBB" class="float-icon-fuwuliu_o"></i></div>
                <p class="introduction">A world alive and without much . The wishing' well I wished for you .</p>
                <div>
                    <i class="float-icon-bianjibiaoge_o"></i>
                    <span class="tag-lable" style="background:#FFB6C1">我会发光啊</span>
                    <span class="tag-lable" style="background:#1E90FF">你是月亮</span>
                </div>
            </div>
            <div>
                <div class="right-tag" style="margin-bottom:10px">
                    <strong>3</strong>
                    <strong>5</strong>
                    <strong>0</strong>
                </div>
                <div class="right-tag" style="margin-bottom:25px">
                    <span>主题</span>
                    <span>日记</span>
                    <span>订阅</span>
                </div>
                <div class="book-tag">订阅我的人(1)</div>
                <div class="book-tag">我订阅的人(0)</div>
            </div>
        </div>
    </div>
    <div class="body-show">
        <div style="width:200px"></div>
        <div style="background:#FFF;">
            <div class="bodyy">
                <h1>时光倒流</h1>
                <p>现在是2019年02月，本月有0天写了日记</p>
            </div>
            <div v-for="(item,index) in essayList" :key="index"> 
                <div class="essay-text">
                    <h3>{{item.name}}</h3>
                    <span>{{item.date}}</span>
                </div>
                <div class="essay-content">
                    <p>{{item.text}}</p>
                </div>
                <hr style="border:1px dashed #000;color:rgb(66, 116, 41);">
            </div>
        </div>
    </div>
</div>
</template>
<style scoped>
.head-show {
    width: 946px;
    display: flex;
}
.head-picture {
    width: 153px;
    display: flex;
}
.head-picture .img {
    width:145; 
    height:145px;
    margin-right: 80px;
}
.head-show .name {
    font-weight: 700;
    font-size: 20px;
    color: rgb(66, 116, 41);
    margin-bottom: 12px;
}
.head-show .introduction {
    font-size: 12px;
    color: #666;
    font-weight: normal;
    line-height: 180%;
    width: 500px;
}
.right-tag {
    display: flex;
    color: #666;
}
.right-tag span,strong {
    width: 39px;
}
.right-tag span {
    font-size: 10px;
}
.book-tag {
    color: rgb(66, 116, 41);
    font-size: 12px;
    margin-bottom: 3px;
}
.tag-lable {
    line-height: 14px;
    font-size: 12px;
    margin: 0 7px;
    color: #FFF;
    padding: 2px 3px;
    border-radius: 4spx;
}
.body-show {
    display: flex;
}
.body-show h1 {
    color: #666;
    font-size: 18px;
    margin: 0 0;
    padding: 10px 0;
}
.body-show p{
    color: #666;
    font-size: 12px;
}
.body-show .bodyy {
    width:730px;
    padding: 10px 20px;
    background: rgb(249, 249, 253);
}
.essay-text h3{
    color: rgb(66, 116, 41);
    font-weight: normal;
    margin: 0 0;
    padding-left: 30px;
}
.essay-text {
    display: flex;
    justify-content: space-between;
}
.essay-text span {
    color: #AAA;
    font-size: 12px;
    display: block;
    line-height: 24.8px;
    padding-right: 10px;
}
.essay-content p{
    width:700px;
    line-height: 20px;
    font-size: 12px;
    padding-left: 30px;
}
</style>
<script>
    export default {
        name: 'LittleWorld',
        components: {
        },
        props: {},
        data() {
            return {
                essayList: [
                    {
                        name: '王坤',
                        date: '2015.03.16 15:32:04',
                        text: '曾经删光了以前的日记。不知道过了多久，我又想写日记了。可能就是因为最近太闲吧。日子不痛不痒的过着，波澜不惊。。现在是大一下学期的生活，期间可能有喜欢过的人。但是总觉得不过是一时好感罢了，似乎也很难会像以前一样那么奋不顾身的喜欢某个人。习惯了对谁都淡淡的态度，也很不容易接受其他人走进自己内心。他们过得还好吧，说到底还是很想念他们。虽然他们已经有了新知己，或许快淡忘我了，可还是不甘心啊，曾经是那么亲密无间。还有朋友用我微信签名发了朋友圈。都在想彼此吧。都应该认了吧！最近总是睡不好，天真的想在熄灯提前半小时上床睡觉。无奈室友总是在熄灯后还是激情的打游戏，偶尔会在没课的时间补个觉但最后还是会吵醒。其实想骂人的，心里简直有一万只草泥马在奔腾啊。最后还是慢慢容忍了。不管怎么样，我是感冒了。挺难受的。不管怎么样，春天来了，还是挺窃喜的。一定要出去多走走。室友要去厦门，本想和我一起去，可我没钱啊。向你爸妈要，他说。可能他觉得理所当然，但我不再这样任性。都是大学生成年人了，有梦想很好，可不能什么事都向爸妈要钱了。或许我很乐意找一个陪我一起省钱的人，然后拿着自己攒下的钱高兴的跟父母说，爸妈，我要去旅游了，钱我自己有，不用操心。找一知己游遍天下多有乐趣啊！我现在过得挺好的，我真这么觉得，虽然有时候不知道要干什么。很庆幸能平平淡淡的过着，简单挺好。'
                    },
                    {
                        name: '王坤',
                        date: '2015.03.16 15:32:04',
                        text: '曾经删光了以前的日记。不知道过了多久，我又想写日记了。可能就是因为最近太闲吧。日子不痛不痒的过着，波澜不惊。。现在是大一下学期的生活，期间可能有喜欢过的人。但是总觉得不过是一时好感罢了，似乎也很难会像以前一样那么奋不顾身的喜欢某个人。习惯了对谁都淡淡的态度，也很不容易接受其他人走进自己内心。他们过得还好吧，说到底还是很想念他们。虽然他们已经有了新知己，或许快淡忘我了，可还是不甘心啊，曾经是那么亲密无间。还有朋友用我微信签名发了朋友圈。都在想彼此吧。都应该认了吧！最近总是睡不好，天真的想在熄灯提前半小时上床睡觉。无奈室友总是在熄灯后还是激情的打游戏，偶尔会在没课的时间补个觉但最后还是会吵醒。其实想骂人的，心里简直有一万只草泥马在奔腾啊。最后还是慢慢容忍了。不管怎么样，我是感冒了。挺难受的。不管怎么样，春天来了，还是挺窃喜的。一定要出去多走走。室友要去厦门，本想和我一起去，可我没钱啊。向你爸妈要，他说。可能他觉得理所当然，但我不再这样任性。都是大学生成年人了，有梦想很好，可不能什么事都向爸妈要钱了。或许我很乐意找一个陪我一起省钱的人，然后拿着自己攒下的钱高兴的跟父母说，爸妈，我要去旅游了，钱我自己有，不用操心。找一知己游遍天下多有乐趣啊！我现在过得挺好的，我真这么觉得，虽然有时候不知道要干什么。很庆幸能平平淡淡的过着，简单挺好。'
                    },
                    {
                        name: '王坤',
                        date: '2015.03.16 15:32:04',
                        text: '曾经删光了以前的日记。不知道过了多久，我又想写日记了。可能就是因为最近太闲吧。日子不痛不痒的过着，波澜不惊。。现在是大一下学期的生活，期间可能有喜欢过的人。但是总觉得不过是一时好感罢了，似乎也很难会像以前一样那么奋不顾身的喜欢某个人。习惯了对谁都淡淡的态度，也很不容易接受其他人走进自己内心。他们过得还好吧，说到底还是很想念他们。虽然他们已经有了新知己，或许快淡忘我了，可还是不甘心啊，曾经是那么亲密无间。还有朋友用我微信签名发了朋友圈。都在想彼此吧。都应该认了吧！最近总是睡不好，天真的想在熄灯提前半小时上床睡觉。无奈室友总是在熄灯后还是激情的打游戏，偶尔会在没课的时间补个觉但最后还是会吵醒。其实想骂人的，心里简直有一万只草泥马在奔腾啊。最后还是慢慢容忍了。不管怎么样，我是感冒了。挺难受的。不管怎么样，春天来了，还是挺窃喜的。一定要出去多走走。室友要去厦门，本想和我一起去，可我没钱啊。向你爸妈要，他说。可能他觉得理所当然，但我不再这样任性。都是大学生成年人了，有梦想很好，可不能什么事都向爸妈要钱了。或许我很乐意找一个陪我一起省钱的人，然后拿着自己攒下的钱高兴的跟父母说，爸妈，我要去旅游了，钱我自己有，不用操心。找一知己游遍天下多有乐趣啊！我现在过得挺好的，我真这么觉得，虽然有时候不知道要干什么。很庆幸能平平淡淡的过着，简单挺好。'
                    },
                    {
                        name: '王坤',
                        date: '2015.03.16 15:32:04',
                        text: '曾经删光了以前的日记。不知道过了多久，我又想写日记了。可能就是因为最近太闲吧。日子不痛不痒的过着，波澜不惊。。现在是大一下学期的生活，期间可能有喜欢过的人。但是总觉得不过是一时好感罢了，似乎也很难会像以前一样那么奋不顾身的喜欢某个人。习惯了对谁都淡淡的态度，也很不容易接受其他人走进自己内心。他们过得还好吧，说到底还是很想念他们。虽然他们已经有了新知己，或许快淡忘我了，可还是不甘心啊，曾经是那么亲密无间。还有朋友用我微信签名发了朋友圈。都在想彼此吧。都应该认了吧！最近总是睡不好，天真的想在熄灯提前半小时上床睡觉。无奈室友总是在熄灯后还是激情的打游戏，偶尔会在没课的时间补个觉但最后还是会吵醒。其实想骂人的，心里简直有一万只草泥马在奔腾啊。最后还是慢慢容忍了。不管怎么样，我是感冒了。挺难受的。不管怎么样，春天来了，还是挺窃喜的。一定要出去多走走。室友要去厦门，本想和我一起去，可我没钱啊。向你爸妈要，他说。可能他觉得理所当然，但我不再这样任性。都是大学生成年人了，有梦想很好，可不能什么事都向爸妈要钱了。或许我很乐意找一个陪我一起省钱的人，然后拿着自己攒下的钱高兴的跟父母说，爸妈，我要去旅游了，钱我自己有，不用操心。找一知己游遍天下多有乐趣啊！我现在过得挺好的，我真这么觉得，虽然有时候不知道要干什么。很庆幸能平平淡淡的过着，简单挺好。'
                    },
                    {
                        name: '王坤',
                        date: '2015.03.16 15:32:04',
                        text: '曾经删光了以前的日记。不知道过了多久，我又想写日记了。可能就是因为最近太闲吧。日子不痛不痒的过着，波澜不惊。。现在是大一下学期的生活，期间可能有喜欢过的人。但是总觉得不过是一时好感罢了，似乎也很难会像以前一样那么奋不顾身的喜欢某个人。习惯了对谁都淡淡的态度，也很不容易接受其他人走进自己内心。他们过得还好吧，说到底还是很想念他们。虽然他们已经有了新知己，或许快淡忘我了，可还是不甘心啊，曾经是那么亲密无间。还有朋友用我微信签名发了朋友圈。都在想彼此吧。都应该认了吧！最近总是睡不好，天真的想在熄灯提前半小时上床睡觉。无奈室友总是在熄灯后还是激情的打游戏，偶尔会在没课的时间补个觉但最后还是会吵醒。其实想骂人的，心里简直有一万只草泥马在奔腾啊。最后还是慢慢容忍了。不管怎么样，我是感冒了。挺难受的。不管怎么样，春天来了，还是挺窃喜的。一定要出去多走走。室友要去厦门，本想和我一起去，可我没钱啊。向你爸妈要，他说。可能他觉得理所当然，但我不再这样任性。都是大学生成年人了，有梦想很好，可不能什么事都向爸妈要钱了。或许我很乐意找一个陪我一起省钱的人，然后拿着自己攒下的钱高兴的跟父母说，爸妈，我要去旅游了，钱我自己有，不用操心。找一知己游遍天下多有乐趣啊！我现在过得挺好的，我真这么觉得，虽然有时候不知道要干什么。很庆幸能平平淡淡的过着，简单挺好。'
                    },
                    {
                        name: '王坤',
                        date: '2015.03.16 15:32:04',
                        text: '曾经删光了以前的日记。不知道过了多久，我又想写日记了。可能就是因为最近太闲吧。日子不痛不痒的过着，波澜不惊。。现在是大一下学期的生活，期间可能有喜欢过的人。但是总觉得不过是一时好感罢了，似乎也很难会像以前一样那么奋不顾身的喜欢某个人。习惯了对谁都淡淡的态度，也很不容易接受其他人走进自己内心。他们过得还好吧，说到底还是很想念他们。虽然他们已经有了新知己，或许快淡忘我了，可还是不甘心啊，曾经是那么亲密无间。还有朋友用我微信签名发了朋友圈。都在想彼此吧。都应该认了吧！最近总是睡不好，天真的想在熄灯提前半小时上床睡觉。无奈室友总是在熄灯后还是激情的打游戏，偶尔会在没课的时间补个觉但最后还是会吵醒。其实想骂人的，心里简直有一万只草泥马在奔腾啊。最后还是慢慢容忍了。不管怎么样，我是感冒了。挺难受的。不管怎么样，春天来了，还是挺窃喜的。一定要出去多走走。室友要去厦门，本想和我一起去，可我没钱啊。向你爸妈要，他说。可能他觉得理所当然，但我不再这样任性。都是大学生成年人了，有梦想很好，可不能什么事都向爸妈要钱了。或许我很乐意找一个陪我一起省钱的人，然后拿着自己攒下的钱高兴的跟父母说，爸妈，我要去旅游了，钱我自己有，不用操心。找一知己游遍天下多有乐趣啊！我现在过得挺好的，我真这么觉得，虽然有时候不知道要干什么。很庆幸能平平淡淡的过着，简单挺好。'
                    }
                ]
            }
        },
        computed: {
        },
        watch: {
        },
        methods: {
        },
        created() {
        },
        destroyed() {
        },
        mounted() {
        }
    }
</script>